
import React, { useState } from 'react';
import styled from 'styled-components';

export const Container = styled.View`
  flex: 1;
  background: #fff;
  width: 100%;
`;

export const Body = styled.ScrollView`
  margin: 30px;
`;

export const AgreeMent = styled.Text`
`;

const JoinAgree1Screen = ({navigation}) => {

  return (
        <Container>
          <Body>
            <AgreeMent>
            서비스 이용 약관

            제 1 장 총칙


            제 1 조(목적)

            이 약관은 주식회사 운복(이하 “회사”라 한다)가 운영하는 브랜드 방비 및 방비존 제공하는 인터넷 관련 서비스 및 기타
            모바일 어플리케이션(이하 “방비 서비스”라 한다)을 이용함에 있어 이용자의 권리,의무 및 책임사항을 규정함을 목적으로 합니
            다. 유료 서비스 상품의 경우 “유료 서비스 이용약관”을 따릅니다. ※「PC 통신, 모바일 무선 등을 이용하는 전자거래에 대해서도 그 성질에 반하지 않는 한 이 약관을 준용합니다.」


            제 2 조(정의)

            ① “방비”(이)라 함은 “콘텐츠” 산업과 관련된 경제활동을 영위하는 자로서 콘텐츠 및 제반 서비스를 제공하는 자를 말합니다.
            ② “이용자”라 함은 “방비”의 사이트에 접속하여 이 약관에 따라 “방비”이(가) 제공하는 “콘텐츠” 및 제반서비스를 이용하는 회
            원 및 비회원, 업체를 말하며, 업체는 “당사”가 제공하는 무료서비스와 유료서비스를 이용하는 자를 말합니다.
            ③ “회원”이라 함은 “방비”와(과) 이용계약을 체결하고 “이용자” 아이디(ID)를 부여받은 “이용자”로서 “방비”의 정보를 지속적으
            로 제공받으며 “방비”이(가) 제공하는 서비스를 지속적으로 이용할 수 있는 자를 말합니다.
            ④ “비회원”이라 함은 “회원”이 아니면서 “방비”이(가) 제공하는 서비스를 이용하는 자를 말합니다.
            ⑤ “업체”이라 함은 회사에 개인정보를 제공하여 회원등록을 한 자로서, 회사와 서비스 이용계약을 체결하고 회원 아이디(ID)를
            부여 받아 고객에게 견적을 보낼 수 있고, 방비를 통해서 견적을 제시하거나 회원 및 비회원에게 서비스 등를 제안하기 위해 본
            서비스를 계속적으로 이용할 수 있는 자를 말합니다.
            ⑥ “무료서비스”라 함은 “회원”과 “회원”이 매칭되기 위하여 주고받을 수 있는 모든 서비스(등록/신청/선택/매칭 등)를 말합니다.
            ⑦ “유료서비스”라 함은 구인을 위한 사이트 결제 및 기타 상품(온라인 콘텐츠 포함)의 유료 제공 및 결제 처리를 위한 제반 서
            비스를 말합니다.
            ⑧ “서비스 대금 결제”라 함은 구인자가 유료서비스를 이용하기 위해 신용카드, 휴대전화, 무통장입금 등의 결제 수단을 활용하
            는 것을 말합니다.
            ⑨ “콘텐츠”라 함은 당사 및 업체에서 제공한 각종 정보, 콘텐츠로서 서비스 상에 게시된 모든 글, 사진, 동영상, 각종 파일, 링
            크, 회원소개 등(부호, 문자, 영상, 그림 등 그 형태를 불문한다)을 말합니다.


            제 2 장 서비스 이용 계약


            제 3 조(약관의 명시와 개정)

            회사는 본 약관의 내용과 회사의 상호, 영업소 소재지, 대표자의 성명, 사업자등록번호, 연락처 등을 회원이 알 수 있도록 초기
            화면에 게시하거나 기타의 방법으로 회원에게 공지합니다. 회사는 관련 법령을 위배하지 않는 범위에서 본 약관을 개정할 수 있습니다
            “당사”가 약관을 개정할 경우에는 적용 일자 및 개정사유를 명시하여 현행 약관과 함께 “당사”홈페이지의 초기 화면에 그 적용
            일자 7일 이전부터 적용 일자 전일까지 공지합니다. 다만, 이용자에게 불리하게 약관 내용을 변경하는 경우에는 최소한 30일 이
            전의 유예기간을 두고 공지합니다.이 경우 “당사”는 개정 전 내용과 개정 후 내용을 명확하게 비교하여 이용자가 알기 쉽도록 표
            시합니다. 회원은 변경된 약관이 공지된 지 15일 이내에 거부의사를 표명할 수 있습니다. 회원이 거부하는 경우 본 서비스 제공자인 회사
            는 15일의 기간을 정하여 회원에게 사전 통지 후 당해 회원과의 계약을 해지할 수 있습니다. 만약, 회원이 거부의사를 표시하지
            않고 서비스를 계속 이용하는 경우에는 동의하는 것으로 간주합니다. 이 약관에 사용되는 용어 중 본 조에서 정하지 아니한 부분은 관계법령 및 일반 관례에 따릅니다. 이 약관에서 정하지 아니한 사
            항과 이 약관의 해석에 관하여는 전자상거래등에서의소비자보호에관한법률,약관의규제등에관한법률,정부가 제정한 전자상거래등
            에서의 소비자보호지침 및 관계법령 또는 상 관례에 따릅니다.


            제 4 조 (이용 계약의 성립)

            이용 계약은 서비스 이용 희망자의 이 약관에 대해 동의한다는 의사표시와 이용 신청에 대한 회사의 승낙으로 성립됩니다. 이 약관에 대한 동의는 이용 신청 당시 링크를 확인함으로써 그 의사표시를 합니다. 14세 미만의 미성년자의 경우 부모님(법정 대리인)의 동의를 확인한 후 이용 계약이 성립됩니다.


            제 5 조 (회원가입 및 승낙)

            회원가입은 회원이 되고자 하는 이용자(이하 “가입신청자”)가 약관의 내용에 동의를 하고, 회사가 정한 가입 양식에 따라 회원정
            보(이용자ID), 비밀번호, 주소, 연락처 등)를 기입하여 회원가입신청을 하고 회사가 이러한 신청에 대하여 승인함으로써 체결됩니
            다.
            이용자의 회원가입신청에 대하여 회사가 승낙한 경우, 회사는 회원 ID/Password와 기타 회사가 필요하다고 인정하는 내용을 이
            용자에게 통지합니다. 회사는 이용자의 신청에 대해서 회원가입을 승낙하는 것을 원칙으로 합니다. 다만, 다음 각 호에 해당하는 신청에 대하여는 승인
            을 하지 아니할 수 있습니다. 본인 실명이 아니거나 다른 사람의 명의를 사용하여 신청하였을 때
            서비스 이용 계약 신청서의 내용을 허위로 기재하였을 때
            사회의 안녕과 질서 혹은 미풍양속을 저해할 목적으로 신청하였을 때
            부정한 용도로 본 서비스를 이용하고자 하는 경우
            영리를 추구할 목적으로 본 서비스를 이용하고자 하는 경우
            본 서비스와 경쟁 관계에 있는 이용자가 신청하는 경우
            기타 이용신청자의 귀책사유로 이용승낙이 곤란한 경우
            회사는 서비스 이용신청이 다음 각 호에 해당하는 경우에는 그 신청에 대하여 승낙 제한사유가 해소될 때까지 승낙을 유보할 수
            있습니다. 회사의 기술상 지장이 있는 경우
            기타 회사의 귀책사유로 이용승낙이 곤란한 경우


            제 7 조 (서비스 이용)

            회원은 사이트를 통한 회원가입 시 발급된 ID 하나로 제1장 제2조 1항에 명시된 모든 사이트에 자동 가입되며, 해당 서비스를
            이용할 수 있습니다. 단, 일부 사이트의 특정 서비스는 별도의 가입절차를 통하여 이용할 수 있으며, 이 경우 해당 사이트의 이
            용 시에는 해당 사이트의 특정서비스에 대한 이용약관이 이 약관보다 우선 적용됩니다. 회원의 최초 서비스 이용신청 이후 사이트가 늘어난 경우에도 신규 사이트의 이용약관에서 달리 명시되지 않는 한 제1항의 내용
            이 마찬가지로 적용됩니다. 이 경우 회사는 신규 사이트의 서비스 개시 일자, 회원자동가입 사실 기타 관련 정보를 그 개시일 7
            일 이전부터 개시 일까지 각 사이트에 공지하거나, 또는 그 개시일 7일 이전까지 이메일 통지 등으로 각 회원에게 개별 통지합니
            다. 방비 서비스 이용은 사이트의 업무상 또는 기술상 특별한 지장이 없는 한 연중무휴, 1일 24시간을 원칙으로 합니다. 회사가 방비에서 제공하는 서비스는 기본적으로 무료입니다. 단, 별도로 업체 회원이 고객에게 견적을 보내는 등 일부 특정 서비
            스를 이용하기 위해서는 회사로부터 구매하거나 무상으로 제공받은 방비를 사용하여야만 해당 서비스를 이용 가능합니다. 유료서비스 이용 요금 및 결제 방식은 해당 서비스에 명시되어 있는 규정에 따릅니다. 회사는 통신판매중개업자로서 서비스 요금이 무료인 서비스와 일부 유료서비스 이용과 관련하여 이용자들 사이에서 발생한 거래
            와 관련된 손해에 대해서는 회사에 고의 또는 중대한 과실이 있는 경우를 제외하고는 책임을 지지 않습니다. 3 장 서비스 제공 및 변경


            제 8 조 (서비스 내용)

            회사가 제공하는 서비스의 내용은 다음과 같습니다. 요청자에게 업체 회원의 견적 정보 제공
            요청자의 요청서를 업체 회원에게 제공
            기타 관련 부수적 서비스


            제 9 조 (정보의 제공 및 광고의 게재)

            회사는 회원에게 서비스 이용에 필요하다고 인정되는 각종 정보에 대해서 사이트 및 이메일, SMS, DM 발송 등 각종 매체에 게
            재하는 방법 등으로 회원에게 제공할 수 있습니다. 회사는 서비스 개선 및 소개 등을 목적으로 회원의 동의 하에 추가적인 개인정보를 요청할 수 있습니다. 회사는 서비스의 운용과 관련하여 사이트, 이메일, SMS, DM 등에 광고 등을 게재할 수 있습니다.


            제 10 조 (서비스 제공의 제한 및 중단)

            회사는 정기점검, 보수, 교체 등 회사가 필요한 경우 및 부득이한 사유로 인하여 서비스 이용에 지장이 있는 경우에는 서비스의
            이용의 전부 또는 일부를 제한하거나 일시 중단할 수 있습니다. 전시, 사변, 천재지변 또는 이에 준하는 국가 비상사태가 발생하거나 발생할 우려가 있는 경우와 정전, 서비스 이용 폭주 등으로
            정상적인 서비스가 불가능한 경우 등 기타 불가항력적인 사유가 있는 경우에는 서비스 이용의 전부 또는 일부를 제한하거나 중
            지할 수 있습니다. 제1항에 의한 서비스 중단의 경우에는 사이트는 회원에게 제11조의 방법으로 통지를 합니다. 단, 사이트가 통제할 수 없는 사유
            로 인한 서비스 중단으로 사전 통지가 불가능한 경우에는 그러하지 아니합니다. 회사는 제1항의 사유로 서비스의 제공이 일시적으로 중단됨으로 인하여 이용자 또는 제3자가 입은 손해에 대하여 배상합니다.
            단, 회사의 고의 또는 과실이 없음을 입증하는 경우에는 그러하지 아니합니다.


            제 11 조 (회원에 대한 통지)

            회사가 회원에 대한 통지를 하는 경우에는 회원이 서비스 이용 신청 시 사이트 화면 또는 회원가입 시 제출한 이메일 주소로 할
            수 있습니다. 회사는 불특정 다수 회원에 대한 통지의 경우 7일 이상 사이트 상에 게시함으로써 개별 통지에 갈음할 수 있습니다.


            제 12 조 (회원탈퇴 및 자격상실)

            회원이 이용계약을 해지하고자 하는 때에는 회원 본인이 방비 내의 메뉴 또는 전화 등의 방법을 이용하여 가입해지를 신청할 수
            있으며, 회사는 즉시 회원 탈퇴 처리를 합니다. 회원 탈퇴가 이루어짐과 동시에 서비스 이용과 관련된 모든 정보는 삭제됩니다. 이로 인해 발생하는 불이익에 대한 책임은 회원
            본인에게 있습니다. 회원이 다음 각 호의 사유에 해당하는 경우, 회사는 회원의 회원자격을 적절한 방법으로 제한 및 정지, 상실 시킬 수 있습니다. 가입 신청 시에 허위 내용을 등록한 경우
            다른 사람의 ‘서비스’이용을 방해하거나 그 정보를 도용하는 등 전자거래질서를 위협하는 경우
            서비스를 이용하여 법령과 본 약관이 금지하거나 공서양속에 반하는 행위를 하는 경우
            제1호 내지 제3호 기타 부정한 방법으로 방비를 적립, 사용한 경우
            회사가 회원 자격을 제한ㆍ정지 시킨 후, 동일한 행위가 2회 이상 반복되거나 10일 이내에 그 사유가 시정되지 아니하는 경우
            회사가 회원자격을 상실시키는 경우에는 회원등록을 말소합니다. 이 경우 회원에게 이를 통지하고, 회원등록 말소 전에 소명할
            기회를 부여합니다.


            제 4 장 방비 사용 및 보상


            제 13 조 (방비 사용 및 보상)

            방비는 회사가 제공하는 서비스를 사용할 때 지불 수단으로 이용될 수 있습니다. 방비는 보상이 필요할 경우 방비 서비스 내에서 유료 결제 서비스마다 보상 정책에 대한 안내를 할 수 있습니다.


            제 14 조 (견적 발생 비용)

            업체 회원은 고객이 작성한 요청서를 열람하고, 고객에게 자신이 제공할 수 있는 용역에 대한 견적을 발송할 수 있습니다. 고객
            이 작성한 요청서의 유효기간은 48시간이며, 해당 시간 내에 견적을 발송할 수 있습니다. 견적 발송은 유료이며, 업체 회원은 회사가 제시하는 견적 발송 서비스 대금을 결제하고 견적 발송 서비스를 이용할 수 있습니
            다. 견적 발송에 대한 대금은 방비로 지급하여야 합니다. 견적 발송 서비스 대금은 업체 회원과 고객 간 원활하고 정확한 매칭을 위하여 서비스의 종류, 지역, 고객의 요청서 밀집도 등
            제반 조건에 따라 차등 산정됩니다. 회사는 업체 회원이 각 견적을 발송하기 전에 지불하여야 하는 대금을 확인할 수 있도록 사
            전 고지합니다. 이를 확인하지 아니하고 견적을 발송함으로써 업체 회원에게 발생한 손해에 대하여는 회사가 책임을 지지 아니합
            니다.


            제 15 조 (미확인 견적 건에 대한 보상)

            견적이 발송된 이후 48시간동안 해당 견적에 대해 고객이 아무런 반응이 없을 경우 (견적이 전달된 채팅방에 진입하지 않았을
            때), 업체 회원은 견적 발송에 지급된 비용을 보너스 캐시로 보상받을 수 있습니다.


            제 5 장 지급 수단


            제 16 조 (방비의 구매 및 환불)

            업체 회원은 견적 발송 및 고객과의 추가 인터랙션을 사용하기 위하여 정액제를 구입할 수 있습니다. 견적 발송 시 업체 회원의
            지역과 제공 서비스에 따라 차등 산정되는 견적 발송 비용에 비례하여 상품군 내역이 보여지게 됩니다. 업체 회원은 충전 캐시를 구매 후 지급받은 날로부터 5년 간 미사용 방비에 대하여 환불을 요청하고, 해당 충전 캐시를 구매하기
            위해 지급한 대금 전액을 환불받을 수 있습니다. 회사는 업체 회원이 환불을 요청한 날로부터 3영업일 이내에 업체 회원이 결제한 수단과 동일한 수단으로 대금을 환불하여야 합
            니다. 다만, PG사를 통한 실질적인 결제 취소는 신용카드 및 휴대폰결제의 경우에는 약 3 내지 5 영업일 정도가 소요될 수 있습
            니다. 카드결제 시점으로부터 1년이 경과한 경우
            휴대폰 소액결제 당월 전액 환불이 아닌 경우
            기타 결제수단으로 환불이 불가한 경우
            회사는 위 대금을 환급함에 있어 업체 회원이 신용카드 또는 전자화폐 등의 결제수단으로 대금을 지급한 때에는 지체 없이 당해
            결제수단을 제공한 사업자로 하여금 대금 청구를 정지 또는 취소하도록 요청합니다. 제1항 또는 제5항에 의한 방비 환불 시 해당 방비 구매에 대한 혜택으로 회사가 업체 회원에게 무상으로 제공한 방비 포인트는
            전액 소멸됩니다. 업체 회원이 구매한 충전 캐시는 업체 회원이 방비에 2년 이상 접속하지 않을 경우 일괄 삭제됩니다. 회원의 등록정보가 허위 정보로 판명되거나 가입 조건 서비스 이용 조건에 부합되지 않는 점이 판명될 경우 징계 및 강제 탈퇴
            가 되며 회원 본인의 귀책사유로 인해 환불 및 보상이 불가능합니다. 회원이 자진탈퇴로 인해 계약이 해지되는 경우, 회원이 보유한 아이템은 자동으로 소멸되어 복구 및 환불이 불가능합니다.


            제 20 조 (회사의 서비스 이용 계약해제, 해지 및 이용제한)

            회사는 거래의 안정성을 위해 해당 약관에서 정한 바에 따라 회원 자격을 정지하거나, 서비스 이용 제한 등의 조치를 취할 수 있
            습니다. 회사는 다른 이용자의 약관 위반 행위에 가공하거나 공모한 이용자 또는 약관 위반 행위를 돕거나 그로 인해 부당한 이득을 취
            한 이용자에 대해서도 해당 약관 위반 행위에 대한 제재를 적용할 수 있습니다. 회사가 회원자격을 정지하거나 이용제한 등 기타 필요한 조치를 취할 경우 이 약관에 특별한 규정이 없는 한 사전에 회원에게
            유선 또는 메일 등 알림을 통해 통보하며 회원이 연락 두절 되거나 긴급을 요하는 부득이한 경우 선조치 후통보 할 수 있습니다. 계정 공유 중 제 3자가 이용자 본인의 계정을 이용하여 약관 위반 행위가 발생한다고 하더라도 이용자 본인 및 해당 계정에 제
            재가 적용될 수 있습니다. 상업적 광고 행위
            “상업적 광고 행위” 란 채팅, 프로필, 게시글 등을 이용하여 이루어지는 아래 각 호의 행위를 의미합니다. - 음란사이트 광고 행위
            - 피라미드, 금융 서비스를 광고하는 행위
            - 위법, 위조 등이 가능한 서비스를 광고하는 행위
            사행 행위
            “사행행위” 란 아래 각 호의 행위를 의미합니다. - 불법 도박 사이트 서비스를 광고하는 행위
            - 사회통념상 납득되지 않는 서비스를 광고하는 행위
            버그 및 제한사항 악용
            “버그 및 제한사항 악용” 이란 아래 각 호의 행위를 의미합니다. - 고의로 서비스 오류를 이용하여 이득을 얻고, 서비스 내 경제 시스템에 영향을 주는 행위
            예) 고용건수 오류를 이용하여 반복적으로 이를 획득하는 행위
            - 고의로 서비스 오류를 이용하여 다른 이용자에게 피해를 주는 행위
            예) 리뷰 작성을 이용하여 다른 이용자에게 고의적 악성 리뷰를 작성하여 피해를 주는 행위
            - 고의로 서비스 오류를 이용하여 시스템에 영향을 주는 행위
            예) 프로그램 오류를 이용하여 서버를 다운 시키는 행위
            어뷰징
            “어뷰징” 이란 아래 각 호의 행위를 의미합니다. - 고의로 리뷰 및 고용 수 등을 조작하는 행위
            - 일반적으로 서비스에 통용되지 아니하는 방법으로 재화를 늘리는 행위
            - 비정상적으로 시스템 설계상 제한을 회피하여 이익을 취하는 행위
            - 시스템상 허용되지 않는 방법으로 다른 이용자의 평판 이익을 늘리는 행위
            불건전 언어 사용
            “불건전 언어 사용” 이란 아래 각 호의 행위를 의미합니다. - 욕설, 비/속어 등을 사용하는 행위
            - 음란한 단어나 노골적인 성 묘사 등을 통해 성적 수치심을 느끼게 하는 표현이나 행동을 하는 행위
            - 다른 이용자에게 불쾌감이나 성적 수치심을 줄 수 있는 명칭을 사용하는 행위
            - 현실에 대한 위협이나 상대방에게 공포심을 느끼게 하는 표현이나 행동을 하는 행위
            - 기타 약관에서 금지하는 표현이나 통신을 하여 상대방에게 불쾌감이나 혐오감을 주는 행위
            - 제3자의 명예, 초상권, 개인정보를 포함한 제반 권리를 침해, 훼손할 목적의 내용이 포함된 대화 등 이에 준하는 행위
            불건전 이름(닉네임) 사용
            “불건전 이름 사용” 이란 온라인 문화를 저해하거나 관계 법령 및 사회질서와 미풍 양속을 저해하는 내용과 욕설 또는 음란한
            내용으로 만든 이름, 비즈니스 네임 등을 포함하여 명명 된 아래 각 호의 행위를 의미합니다. - 방비 직원 및 관리자 또는 제3자를 사칭하는 행위
            - 욕설, 비/속어 등을 사용하는 행위
            - 다른 이용자에게 불쾌감이나 성적 수치심을 줄 수 있는 명칭을 사용하는 행위
            - 기타 약관에서 금지하는 명칭을 사용하는 행위
            관련 계정의 닉네임 등은 임의로 변경될 수 있습니다. 명의도용
            “명의도용” 이란 아래 각 호의 행위를 의미합니다. - 타인의 개인정보를 이용하여 계정을 생성하는 행위
            결제도용
            “결제도용” 이란 아래 각 호의 행위를 의미합니다. - 타인의 결제수단을 무단으로 이용하여 서비스 이용요금 등을 결제하는 행위
            불건전 게시물 게시
            “불건전 게시물 게시” 란 아래 각 호의 행위를 의미합니다. - 회사 또는 제3자의 권리(저작권, 특허 등)를 침해하는 게시물
            - 본인/타인의 개인정보(신상정보, 위치, 연락처, 이메일 등)이 포함된 게시물
            - 다른 사람에게 성적 수치심을 주거나 혐오감, 불쾌감을 유발하는 게시물
            - 다른 사람을 비방하거나 음해하는 목적의 게시물(인신공격, 루머 포함) - 영리 목적의 광고 게시물(경품, 상품광고, 사이트 홍보 등) - 악성코드가 포함되어 있거나 시스템 장애를 유도하는 게시물
            - 특정 사상/종교적 색채가 짙은 게시물
            - 특정 개인 및 회사에 대한 허위 사실을 악의적으로 유포하는 게시물
            - 인종, 성, 특정 지역을 비하하거나 차별하는 게시물
            - 폭력, 비행, 사행심을 조장하는 게시물
            - 약관 위반 행위와 관련된 게시물
            - 기타 약관, 관련 법령에서 금지하는 게시물
            - 짧은 시간에 많은 양의 게시물을 등록하거나 동일한 내용을 반복 게시하여 운영을 방해하는 행위
            회원은 회사의 해제․해지 및 이용제한에 대하여 이의신청을 할 수 있습니다. 회원의 이의신청이 정당한 경우 회사는 즉시 회원이
            서비스를 이용할 수 있도록 필요한 조치를 취합니다.


            제 21 조 (회사의 계약해제․해지의 효과)

            회원의 귀책사유에 따른 이용계약의 해제·해지시 잔여 보너스 등은 소멸합니다. 잔여 금액이 있을 경우 회사는 회원가입시 회원
            이 입력한 연락처로 최소 30일의 기간을 두고 잔여 금액을 환불 위한 계좌정보 등을 입력할 것을 최고합니다. 회원이 최고 기간
            내 환불을 위한 정보를 입력하지 않을 경우 잔여 금액은 소멸합니다. " 회사가 제19조 제2항에 따라 서비스 이용계약을 해제 또는 해지한 경우 회사는 회원에게 손해배상을 청구할 수 있습니다. 다만, 회원이 고의 또는 과실 없음을 증명한 경우에는 그러하지 않습니다.


            제 7 장 안전거래서비스


            제 22 조 (안전거래서비스)

            회사는 업체 회원과 고객이 서비스를 이용함에 있어 안전하고 편리한 금전 거래를 위하여 대금의 수령, 보관 및 송금업무로 이루
            어지는 에스크로 방식의 안전거래서비스를 제공합니다. 안전거래 진행 여부에 대한 동의를 하고, 안전거래를 위한 계좌를 등록한 업체 회원에 한하여 안전거래 서비스를 이용할 수 있습
            니다. 각 거래에 대한 안전거래서비스는 업체 회원 또는 고객의 요구에 따라 개시됩니다. 업체 회원은 거래금액과 예상 서비스이행완료
            일을 포함한 최종 안전거래 내용을 발송하며, 고객은 서비스에 대한 수수료 안내를 받은 뒤 수수료와 거래금액을 합한 대금을 안
            전거래서비스에 입금합니다. 회사는 안전거래서비스를 통해 고객이 입금한 대금을 보관합니다. 업체 회원이 서비스를 이행한 이후 고객이 서비스 상 거래 확
            정 버튼을 클릭하는 방식으로 거래 확정을 하면 회사는 보관하는 대금 중 수수료를 제외한 거래금액을 업체 회원에게 지급합니
            다.


            제 23 조 안전거래서비스 계좌 등록

            업체 회원은 안전거래서비스를 위하여 자신이 용역 대금을 수령할 계좌를 지정하여 올바른 정보를 입력하여야 합니다. 업체 회원이 입력한 계좌의 예금주는 업체 회원이 실명확인을 하여 가입할 때 동일인임을 원칙으로 합니다.


            제 24 조 안전거래서비스 이용료 등

            방비안전거래서비스를 이용하기 위한 이용료는 유료가 원칙이며 회사는 안전거래서비스 이용료를 안전거래서비스 안내페이지에
            안내합니다. 안전거래서비스에 대한 이용료는 고객이 부담합니다. 대금 송금 또는 결제로 인하여 별도의 수수료가 발생할 경우 해당 수수료는 대금을 송금하는 회원(고객)이 부담하여야 합니다.
            안전거래서비스에 이미 고객이 이용료를 포함한 대금을 지급하였으나 계약이 파기된 경우 회사는 고객에게 이용료를 제한 거래
            금액만을 반환합니다. 자세한 반환에 대한 규정은 회사의 별도 규정에 따릅니다.


            제 25 조 예치금의 지급

            회사는 고객이 거래 확정을 하면 바로 대금을 업체 회원에게 지급하는 것을 원칙으로 합니다. 다만 금융기관 또는 전기통신사업
            자의 귀책 등 회사의 귀책사유가 없는 사유로 지급이 늦어질 수 있습니다. 고객은 업체 회원이 용역 이행을 완료하였을 때 지체 없이 거래 확정을 하여 업체에게 대금이 원활히 지급될 수 있도록 하여야
            합니다. 고객이 다음과 같이 정당한 사유 없이 거래 확정 의무를 다하지 않는 경우 회사는 고객이 거래 확정하였다고 간주하고 대금을
            지급하고 관련 절차를 진행할 수 있습니다. 업체 회원이 용역 이행을 완료하였음을 고지하였음에도 고객이 10일 이상 업체 회원이나 회사의 연락에 응하지 아니하는 경우
            업체 회원이 용역 이행을 완료하여 이를 고지하였고 고객이 이를 확인하였음에도 고객이 해당 확인 일자로부터 10일 이상 거래
            확정을 하지 아니하는 경우
            기타 고객이 정당한 사유없이 거래확정을 아니하여 회사가 거래 확정처리를 하는 경우


            제 26 조 안전거래서비스에 대한 회사의 면책

            안전거래서비스는 업체 회원과 고객 간의 거래의 안전과 신뢰성 향상을 위한 목적에서 회사가 제공하는 서비스의 일환이므로 회
            사는 안전거래서비스를 이용하는 양 당사자 간의 거래에 어떠한 책임도 지지 않습니다. 회사는 안전거래서비스를 이용하는 업체 회원과 고객 중 어느 일방을 대리, 대행하거나 그 이행을 보조하는 위치에 있지 아니합
            니다. 안전거래를 위하여 잘못된 정보를 입력하여 잘못된 대금지급이 이루어졌을 경우 회사는 이에 대하여 책임지지 않습니다. 회사는 양 당사자간의 거래에 대하여 책임을 부담하지 아니하며 특히 고객의 거래 확정으로 거래가 승인된 이후 발생한 분쟁에
            대하여 책임지지 않습니다. 거래 확정 후 대금의 지급이 완료된 이후 발생한 분쟁 또는 불만 사항은 양 당사자가 협의를 통해 해
            결해야 합니다.


            제 8 장 개인 정보의 처리


            제 27 조 (회원의 개인정보 보호)

            회사는 회원의 개인정보를 보호하기 위하여 정보통신망법 및 개인정보 보호법 등 관계 법령에서 정하는 바를 준수하며 이용자의
            개인 식별이 가능한 개인정보를 수집하는 때에는 반드시 당해 이용자의 동의를 받습니다. 회사의 개인정보 보호는 방비 개인정보처리방침에 따릅니다.


            제 9 장 당사자의 의무


            제 28 조 (회사의 의무)

            회사는 회원이 희망한 서비스 제공 개시 일에 특별한 사정이 없는 한 서비스를 이용할 수 있도록 하여야 합니다. 회사는 계속적이고 안정적인 서비스의 제공을 위하여 설비에 장애가 생기거나 기계의 결함이 있는 때에는 부득이한 사유가 없는
            한 지체 없이 이를 수리 또는 복구합니다. 회사는 개인정보 보호를 위해 보안시스템을 구축하며 개인정보 보호정책을 공시하고 준수합니다. 회사는 회원으로부터 제기되는 의견이나 불만이 정당하다고 객관적으로 인정될 경우에는 적절한 절차를 거쳐 즉시 처리하여야
            합니다. 다만, 즉시 처리가 곤란한 경우는 이용자에게 그 사유와 처리일정을 통보하여야 합니다.


            제 29 조 (회원의 의무)

            회원은 다음 각 호의 행위를 하여서는 안 됩니다. 회원가입신청 또는 변경 시 허위내용을 등록하는 행위
            방비에 게시된 정보를 허위로 변경하는 행위
            회사 기타 제3자의 인격권 또는 지적재산권을 침해하거나 업무를 방해하는 행위
            다른 회원의 ID를 도용하는 행위
            관련 법령에 의하여 그 전송 또는 게시가 금지되는 정보(컴퓨터 프로그램 등)의 전송 또는 게시하는 행위
            회사의 직원이나 관리자를 가장하거나 사칭하여 또는 타인의 명의를 오용하여 글을 게시하거나 메일을 발송하는 행위
            컴퓨터 소프트웨어, 하드웨어, 전기통신 장비의 정상적인 가동을 방해, 파괴할 목적으로 고안된 소프트웨어 바이러스, 기타의 다
            른 컴퓨터 코드, 파일, 프로그램을 포함하고 있는 자료를 게시하거나 전자우편으로 발송하는 행위
            스토킹(stalking) 등 다른 회원을 괴롭히는 행위
            다른 회원에 대한 개인정보를 그 동의 없이 수집, 저장, 공개하는 행위
            회사가 제공하는 서비스에 정한 약관 기타 서비스 이용에 관한 규정을 위반하는 행위
            외설 또는 폭력적인 메시지ㆍ화상ㆍ음성 기타 공서양속에 반하는 정보를 공개 또는 게시하는 행위
            사실관계를 왜곡하는 정보제공 등 기타 회사가 부적절하다고 판단하는 행위
            제1호 내지 제12호 기타 부정한 방법으로 방비를 적립, 사용한 경우
            기타 관계 법령이나 회사에서 정한 규정에 위배되는 행위
            회원이 개인의 정보를 허위 또는 잘못 기재하여 생기는 불이익에 대한 책임은 회원 본인에게 있으며, 이에 대해 회사는 아무런
            책임이 없습니다. 회사가 사이트 운영상 부적절하다고 판단한 정보가 게시된 경우, 회사는 게시를 행한 자의 승낙 없이 게재된 당해 정보를 삭제할
            수 있습니다. 단, 회사는 이러한 정보의 삭제 등을 할 의무를 지지 않습니다. 회사는 회원이 본 약관 또는 당사 정책에 위반되는 내용의 메시지를 프로필 영역에 작성하거나 타 회원에게 해당 메시지 내용을
            발송하는 경우 별도의 통지 없이 작성 또는 발송된 내용을 임의로 수정 또는 삭제할 수 있습니다. 제1항에 해당하는 행위를 한 회원이 있을 경우 회사는 본 약관 제12조, 제21조에서 정한 바에 따라 회원의 회원자격을 적절한
            방법으로 제한 및 정지, 상실시킬 수 있으며, 특히 아래 각 호에 해당하는 행위를 할 경우에는 각각에 대응되는 조치를 취할 수
            있습니다. 다만, 회사가 취할 수 있는 조치는 아래 각 호에 한정되지 아니하며, 회사가 조치를 취할 수 있는 회원의 불법적인 행
            위 역시 아래 각 호의 경우에 한정되지 아니합니다. 타 회원들에 대한 무단 마케팅(요청서 및 견적에 제공 용역에 대한 내용 외 본인의 영리적 목적을 위한 내용을 무단으로 작성하
            는 것을 의미하며 광고 등을 포함): 1년간 모든 기능 사용 정지 등
            타 회원들에 대한 부적절한 대화 시도 및 메시지 발송 등(욕설, 성희롱, 기타 부적절한 표현을 포함함): 1년간 모든 기능 사용 정
            지 등
            타 회원들에게 허위사실을 유포하거나 표시광고를 위반하는 경우(견적에 회사에 상당한 수수료를 지불하고 있어, 절대 채팅으로
            답변하지 말라는 내용을 기재하거나, 명함에 방비 로고를 무단으로 표시하고 자신을 방비협력사로 소개하는 등을 포함함): 1회
            경고 후 재 적발시 영구 기간 동안 모든 기능 사용 정지(영구 제재) 등
            업체 회원의 의무 및 서비스 정책 위반(프로필에 계속하여 휴대폰 번호 등 개인정보를 노출, 요청서 또는 견적에 본인 연락처를
            작성하여 직접 연락을 유도하는 등의 경우를 포함함): 1년간 모든 기능 사용 정지 등
            회원은 그 귀책사유로 인하여 회사나 다른 회원이 입은 손해를 배상할 책임이 있습니다. 회원은 서비스의 이용과 관련하여 관계법령, 약관, 세부이용지침, 서비스 이용안내 및 회사가 통지한 공지사항 등을 준수하여야
            하며, 이를 수시로 확인하여야 합니다.


            제 30 조 (고객의 의무)

            고객은 제공받기 원하는 용역에 대한 내용으로 요청서를 작성하여 회사에 제공하고 회사가 이를 다수의 업체 회원에게 전달하는
            것에 대하여 동의합니다. 고객은 허위나 과장된 내용으로 요청서를 작성하거나 또는 용역을 제공받고자 하는 의사가 없음에도 요청서를 작성할 수 없으며
            허위 및 과장된 내용으로 요청서를 작성함에 따라 용역을 제공받지 못하거나 법적인 문제가 발생할 경우 이에 대한 책임은 고객
            에게 있습니다. 고객은 용역을 구매하기 전에 반드시 업체 회원이 견적에 작성한 용역의 상세 내용과 거래의 조건을 정확하게 확인해야 합니다. 구매하려는 용역의 내용과 거래의 조건을 확인하지 않고 구매하여 발생한 모든 손실과 손해는 고객 본인이 부담합니다.


            제 31 조 (업체 회원의 서비스 관련 의무)

            업체 회원은 용역의 제공, 계약내용의 변경, 용역 대금 결제 및 환불 등 용역 제공과 관련한 일체의 업무를 처리하며, 이를 신의
            성실 하게 이행하여야 할 의무가 있습니다. 또한 용역 제공과 관련하여 발생하는 모든 책임과 의무를 부담합니다. 업체 회원이 작성한 견적, 프로필 등에 허위 또는 과장, 기재누락, 오기가 있어서는 아니되며 이를 준수하지 아니하여 발생하는
            모든 법적문제에 대하여는 업체 회원이 모든 책임을 부담합니다. 업체 회원은 해당 견적 및 제공 용역에 대한 진실성과 적법성에
            대해 보증합니다. 업체 회원은 작성한 견적, 용역의 내용, 용역 제공 시기 등 내용의 변경 사항이 있을 경우 이를 바로 갱신하여야 할 의무를 집니
            다. 업체 회원은 관련법령 등을 위반하는 불법적인 용역을 제공하지 않는 다른 점에 대해 보증하며 불법적이거나 본 이용약관을 위
            반하는 내용으로 견적및 허위 내용을 작성하여 고객에게 송부할 수 없습니다. 업체 회원은 견적을 수령한 고객과의 방비 서비스에서 제공하는 메시지 기능이나 전화 등 별도의 연결수단을 통하여 세부사항을
            조정할 수 있습니다. 회사는 견적 발송 이후 업체 회원과 고객 간에 발생한 일체의 문제에 대하여 어떠한 책임도 지지 않습니다.


            제 32 조 (회원의 ID 및 비밀번호에 대한 의무)

            원칙적으로 ID와 비밀번호에 관한 관리책임은 회원에게 있습니다. 회원은 자신의 ID 및 비밀번호를 제 3자에게 이용하게 해서는 안 되며, 그로 인한 모든 책임은 회원에게 있습니다. 회원이 자신의 ID 및 비밀번호를 도난당하거나 제3자가 사용하고 있음을 인지한 경우에는 바로 회사에 통보하고 회사의 안내가
            있는 경우 그에 따라야 합니다. 만약 회원이 위 사실을 인지하고도 회사에 대한 통보를 지체함으로써 발생한 손해에 대해서 회사
            는 배상할 의무가 없습니다.


            제 33 조 (게시물 또는 내용물의 삭제)

            회원이 회사에 등록하는 게시물 및 타인 게시물의 활용 등으로 인하여 본인 또는 타인에게 손해나 기타 문제가 발생하는 경우
            회원은 이에 대한 책임을 지게 되며, 회사는 이에 대하여 책임을 지지 않습니다. 회사는 회원이 게시하거나 등록한 내용이 제27조 제 1항의 규정에 위반되거나 회사 소정의 게시기간을 초과하는 경우 사전 통지
            나 동의 없이 이를 삭제할 수 있습니다. 그러나 회사가 이러한 정보의 삭제 등을 할 의무를 지는 것은 아닙니다.


            제 34 조 (저작권의 귀속 및 권리, 의무)

            회사가 작성한 저작물에 대한 저작권 기타 지식재산권은 회사에 귀속합니다. 회원은 회사의 서비스를 이용함으로써 얻은 정보를 회사의 사전승낙 없이 복제, 전송, 출판, 배포, 방송 기타 방법에 의하여 영리
            목적으로 이용하거나 제3자에게 이용하게 하여서는 안 됩니다. 회원이 작성한 게시물에 대한 모든 권리 및 책임은 이를 게시한 회원에게 있습니다. 회사는 회원 또는 요청자가 사이트에 게시한 다음 각 호의 게시물을 회사의 서비스 제공과 관련한 마케팅 용도로 사용ㆍ복제ㆍ 수정ㆍ출판ㆍ배포 할 수 있습니다. 단, 회사는 게시물 이용시 업체 또는 요청자의 개인정보가 포함되지 않는 범위에서 해당 정보
            를 처리하고, 최대한 작성자의 권리를 보호할 수 있도록 노력할 것입니다.

            가. 업체의 프로필 정보
            나. 요청자 및 업체가 작성한 후기(이에 포함된 글 및 사진)
            다. 요청서 및 견적의 내용
            라. 회사와 요청자 또는 업체 사이의 연락 내용
            마. 기타 요청자 및 업체가 서비스 이용과정에서 작성·게시한 콘텐츠


            제 35 조 (광고주 및 연결 사이트와의 관계)

            회사의 공식 사이트 이외의 웹사이트 및 이메일에서 링크된 사이트에서는 회사의 개인정보 보호정책 및 본 약관이 적용되지 않
            습니다. 회사는 방비 사이트 또는 e-mail 상에 게재되어 있거나 본 서비스를 통한 광고주의 판촉활동에 회원이 참여하거나 교신 또는 거
            래를 함으로써 발생하는 손실과 손해에 대해 책임을 지지 않습니다.


            제 10 장 기타


            제 36 조 (양도의 금지)

            회원은 서비스 이용 권리를 타인에게 대여, 양도 또는 증여 등을 할 수 없으며, 또한 질권의 목적으로도 사용할 수 없습니다.


            제 37 조 (면책)

            회사는 천재지변 또는 이에 준하는 불가항력으로 인하여 서비스를 제공할 수 없는 경우에는 고의 또는 과실이 없는 한 구매자에
            게 발생한 손해에 대하여 서비스 제공에 관한 책임이 면제됩니다. 회사는 회원의 귀책사유로 인한 서비스 이용의 장애에 대하여 책임을 지지 않습니다. 회사는 회원이 서비스의 이용을 통해 예상했던 금전적인 수익을 얻지 못하게 되거나, 서비스를 통하여 얻은 자료로 인해 손해를
            보게 되더라도 이에 관하여 책임을 지지 않습니다. 회사는 회원이 서비스에 게재한 정보, 자료, 사실의 신뢰도, 정확성 등의 내용에 관하여는, 회사가 해당 정보의 허위성을 명백히
            인지하였다는 특별한 사정이 없는 한, 책임을 지지 않습니다. 회사가 본 약관과 관련 법령에 따른 조치를 취한 경우에도 같습니
            다. 회사는 서비스 이용과 관련하여 회사의 고의, 과실에 의하지 아니한 손해에 대하여 책임을 지지 않습니다. 회사는 기간통신 사업자가 전기통신 서비스를 중지하거나 정상적으로 제공하지 아니하여 손해가 발생한 경우 책임이 면제됩니다. 회사는 회원들에게 요청서와 견적을 전달하거나 광고플랫폼 또는 안전거래서비스를 제공하고 이에 대한 부수적인 서비스를 제공
            할 뿐이므로 회원 상호 간 서비스를 매개로 하여 거래를 한 경우 이용자 각자의 의무이행에 대한 책임은 각 이용자에게 있으며
            회사는 이에 대한 책임이 없습니다. 회사는 회원들에게 요청서와 견적을 전달하거나 광고플랫폼 또는 안전거래서비스를 제공하고 이에 대한 부수적인 서비스를 제공
            할 뿐이므로 업체와 요청자 간 거래와 관련하여 발생한 의무의 불완전 이행, 이행 지체 등 용역 이행 미비, 사후처리, 대금 정산, 완성품의 하자, 청약철회, 물품의 반품 등 어떠한 법적 분쟁 및 사후처리에 대해서도 개입하거나 책임지지 않습니다. 회사는 무료로 제공되는 서비스 이용과 관련하여 관련법에 특별한 규정이 없는 한 책임을 지지 않습니다. 회사는 회원 간에 분쟁이 발생하였을 경우 고의 또는 중과실이 없는 한 회원 간 법적 문제에 대하여 책임을 지지 않습니다.


            제 38 조 (손해배상)

            당사자 일방이 본 계약상 의무를 위반함으로 인하여 상대방에게 손해가 발생한 경우, 귀책사유 있는 당사자는 상대방이 입은 손
            해를 배상합니다.


            제 39 조 (비밀유지)

            당사자는 서비스를 이용하는 과정에서 알게 된 상대방의 정보 또는 이용자의 정보를 제3자에게 누설, 공개하지 아니합니다. 본 조는 이용계약이 해지되거나 서비스 제공이 중단된 이후에도 유효합니다.


            제 40 조 (고객센터)

            회사는 이용자에게 생긴 문제를 해결하기 위해 최선을 다하며 이를 위하여 이용자로부터 고객센터에 제출되는 불만 사항 및 의
            견은 우선적으로 그 사항을 처리합니다. 다만, 신속한 처리가 곤란한 경우에는 이용자에게 그 사유와 처리일정을 즉시 통보합니
            다. 회사와 이용자 간 분쟁이 발생할 경우 양자 간 합의에 의하여 처리하는 것을 원칙으로 하며 회사는 이용자 간 발생한 법적 문제
            에 대하여 고의 또는 중과실이 없는 한 책임이 없습니다. 그러나 회사는 고객센터를 통하여 피해 사항을 적극적으로 청취하여 이
            용자들 간 발생한 문제가 해결하는 데에 도움이 될 수 있도록 최선을 다합니다.


            제 41 조 (재판권 및 준거법)

            회사와 이용자간 발생한 분쟁에 관한 소송의 관할은 민사소송법에 따라 정합니다. 회사와 이용자 간에 제기된 소송에는 대한민국법을 적용합니다.


            제 42 조 (추가 약관 및 정책)

            방비 보증에 대한 약관은 ‘방비 보증 약관’에서 확인할 수 있습니다.


            부칙

            제1조 (시행일) 이 약관은 2021년 5월 1일부터 시행합니다.
            </AgreeMent>
          </Body>
        </Container>
  );
};

export default JoinAgree1Screen;
